---
type: LossFactor
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 4
tags: [revit-api, class]
---

# LossFactor

`Autodesk.Revit.DB.Lighting.LossFactor` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Clone | 2013 | `public LossFactor Clone ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LossFactorValue | 2013 | `public double LossFactorValue { get ; }` |